Tekla.Structures.Model.LoadGroup.LoadGroupDirection
The possible directions.

Tekla.Structures.Model.LoadGroup.LoadGroupDirection.DIR_X
The X direction.

Tekla.Structures.Model.LoadGroup.LoadGroupDirection.DIR_Y
The Y direction.

Tekla.Structures.Model.LoadGroup.LoadGroupDirection.DIR_Z
The Z direction.

Tekla.Structures.Model.LoadGroup.LoadGroupDirection.DIR_NEG_X
The negative X direction.

Tekla.Structures.Model.LoadGroup.LoadGroupDirection.DIR_NEG_Y
The negative Y direction.

Tekla.Structures.Model.LoadGroup.LoadGroupDirection.DIR_NEG_Z
The negative Z direction.